projects/03_OpenFOAM_Schaefer_Turek_2D2_Benchmark/case/runs/run_002_refined_validation/constant/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}

viscosityModel  constant;

nu              1e-03;
